class TestFour:
    group_1 = {1, 2, 3, 4, 22, 23, 24, 25, 43, 44, 45, 46, 64, 65, 66, 67, 85, 86, 87, 88, 89}
    group_2 = {5, 6, 7, 8, 9, 26, 27, 28, 29, 47, 48, 49, 50, 68, 69, 70, 71, 90, 91, 92}
    group_3 = {10, 11, 30, 31, 32, 51, 52, 53, 54, 72, 73, 74, 75, 93, 94, 95, 96}
    group_4 = {12, 13, 14, 33, 34, 35, 55, 56, 76, 77, 97, 98}
    group_5 = {15, 16, 36, 37, 57, 58, 78, 79, 80, 99, 100, 101}
    group_6 = {17, 18, 38, 39, 59, 60, 81, 82, 102, 103}
    group_7 = {19, 20, 21, 40, 41, 42, 61, 62, 63, 83, 84, 104, 105}

    TEST_4_POSITIVE = [
        {
            'ru': {
                'points': '3.6-4.0',
                'characteristic': 'Интерес и Энтузиазм',
                'description': 'Тона вершины шкалы. Это не означает, что люди, которые находятся в тонах интереса или энтузиазма, постоянно и безгранично счастливы. Они испытывают все варианты эмоций, но достаточно быстро возвращаются в привычное для себя оптимистичное состояние. Здесь человек наиболее здраво размышляет, принимает правильные решения. Он конструктивен, готов брать ответственность, воодушевлять других, менять их точку зрения. Не унижает других и сам имеет развитое чувство собственного достоинства. Обычно у него хорошие отношения с окружающими. Все это делает его потенциально очень перспективным сотрудником. Но необходимо предусмотреть возможность карьерного роста такого человека и дать ему возможность большой игры, чтобы он задержался в компании.',
            },
            'kz': {
                'points': '3.6-4.0',
                'characteristic': 'Қызығушылық пен ынта',
                'description': 'Шкаланың жоғарғы жағындағы тондар. Бұл мұндай тондағы адамдар үнемі бақытты дегенді білдірмейді. Олар эмоциялардың барлық түрлерін бастан кешіреді, бірақ әдеттегі оптимистік күйіне тез оралады. Бұл жерде адам парасатты ойлайды және дұрыс шешім қабылдайды. Ол конструктивті, жауапкершілікті алуға, басқаларды шабыттандыруға, олардың көзқарасын өзгертуге дайын. Өзгелерді кемсітпейді және өз қабілетін бағалау қасиеті дамыған. Әдетте ол айналасындағылармен жақсы қарым-қатынаста. Мұның бәрі оның өте жан-жақты қызметкер екенін көрсетеді. Мұндай адамға міндетті түрде мансаптық өсу мүмкіндігін қамтамасыз ету керек және ол компанияда ұзақ қалуы үшін оған үлкен істерді атқаруға мүмкіндік беру керек. Бұл адамның қабілеттерін қысып, ішінде сақтатуға болмайды.',
            }
        }
    ]
    TEST_4_NEGATIVE = [
        {
            'ru': {
                'points': '3.1-3.5',
                'characteristic': 'Консерватизм',
                'description': 'Тон профессионалов, людей, знающих «что почем». Это уравновешенные, терпеливые люди, которые предпочитают стабильность и проверенные успешные действия. Осторожно относятся к кардинальным изменениям и новым идеям, тщательно все взвешивают. Обычно это люди этичные, честные, неконфликтные, согласные с тем, что у других может быть иная точка зрения.                          Если вы хотите, чтобы кто-то придумал смелую и креативную рекламную кампанию - это не к ним. Но лучшего бухгалтера или преподавателя не найти. Это ответственные люди, которые будут перепроверять все данные и делать свою работу качественно. Они умеют планировать, настойчивы и последовательны, обычно имеют высокий уровень мотивации и лояльны. Задача руководителей - обеспечить такого сотрудника ясной целью и убедить, что риски невелики, а результат стоит усилий.',
            },
            'kz': {
                'points': '3.1-3.5',
                'characteristic': 'Консерватизм',
                'description': '«Ненің не екенін» білетін, кәсіби көзқарастағы адамдар тобы. Олар тұрақты, сабырлы, тұрақтылықты жаны қалайтын, шыдамды адамдар. Түбегейлі өзгерістер мен жаңа идеяларға сақтықпен қарайды, бәрін мұқият таразылайды. Әдетте бұл адамдар этиканы жоғары бағалайтын, адал, конфликтке жақын емес, басқалардың көзқарасын құрметтей біледі. Егер сіз біреудің батыл және креативті жарнамалық идеяны ұсынғанын қаласаңыз, бұл оларға арналған іс емес екенін біліңіз. Бірақ олардан жақсы бухгалтер мен мұғалім шығады. Бұлар жауапкершілігі мол,  деректерді бір емес, екі рет тексеретін және жұмысын тиімді әрі нақты атқаратын адамдар. Олар нақты жоспар құра алады, табанды және мотивациясы, ынтасы жоғары. Басшылардың негізгі міндеті - мұндай қызметкерге нақты мақсат қойып беру және қауіптердің аз екенін және нәтиженің күш салуға тұрарлық екеніне сендіру керек.',
            }
        }
    ]
    TEST_5_POSITIVE = [
        {
            'ru': {
                'points': '2.6-3.0',
                'characteristic': 'Скука',
                'description': 'Люди в хронической скуке - приспособленцы. Могут неплохо выполнять рутинную работу, но на прорыв в каком-то деле с ними точно рассчитывать не стоит. Они спокойны и безынициативны, не провоцируют конфликты. Кстати, такие сотрудники отлично справляются с недовольными клиентами в гневе. Их устраивает нынешнее положение дел, они не амбициозны и редко делают что-то выдающееся. В работе с ними необходимо постоянно говорить, что все в порядке, но при этом давать маленькие, легко достижимые, требующие небольших усилий цели.',
            },
            'kz': {
                'points': '2.6-3.0',
                'characteristic': 'Жалығу',
                'description': 'Созылмалы зерігудегі адамдар. Олар күнделікті іш-пыстырарлық жұмысты жақсы орындай алады, бірақ сіз оларға қандай да бір маңызды әрі ауқымды істе сенім арта алмайсыз. Олар сабырлы және бірінші болып іс бастамайды, жанжал тудырмайды. Сонымен қатар, мұндай қызметкерлер ашулы және әрдайым наразы болып жүретін адамдармен тамаша тіл табыса алады. Олар қазіргі жағдайларына қанағаттанады, талпынысы жоғары деңгейде емес және таңқалдыратындай нәрселерді сирек істейді. Олармен бірге жұмыс жасағанда, сіз үнемі барлығы жақсы екенін айтып отыруыңыз керек, бірақ онымен қоса, шағын, оңай қол жеткізетін, аз күш жұмсайтын жұмыстар тапсыруыңыз керек.',
            }
        }
    ]
    TEST_5_NEGATIVE = [
        {
            'ru': {
                'points': '2.1-2.5',
                'characteristic': 'Антагонизм',
                'description': 'Это граница между низкими и высокими тонами. Тут уже человек принимает разумные решения большую часть времени. Люди в антагонизме - это прямые, честные и бестактные критиканы. Но в то же время они достаточно продуктивны. Постоянно готовы к ссоре, но уже не просто кричат, что все не правы, а аргументируют это. Тут нужно направить эту неуемную энергию в правильное русло: найти фирму-конкурента или коллегу-мастера, с которыми такой человек будет вечно соревноваться. Иногда они вырастают в начальников, так как могут достигать неплохих результатов в подобных состязаниях. С человеком в антагонизме можно работать, используя тона скуки: не спорить и сказать, что он прав, теперь все нормально, и проблемы будут решены.',
            },
            'kz': {
                'points': '2.1-2.5',
                'characteristic': 'Антагонизм',
                'description': 'Бұл төмен және жоғары тондар арасындағы шекара. Мұнда адам көп жағдайда ақылға қонымды шешімдер қабылдайды. Антагонизмдегі адамдар тік мінезді, адал және әдепсіз сыншылар. Бірақ сонымен қатар олар өнімді жұмыс жасайды. Олар үнемі жанжалға дайын, бірақ олар барлығының дұрыс еместігін айғайлап айтпайды, тек нақты аргумент, дәлел келтіреді. Бұл жерде бұл энергияны дұрыс бағытта жұмсай білу керек: мұндай адамға әрдайым бәсекелес болатындай конкурент-фирма немесе профессионал адам табу арқылы. Кейде олар бастық болуы мүмкін, өйткені олар осы сияқты жарыстарда жақсы нәтижелерге қол жеткізеді. Антогонизмдегі адаммен жұмыс жасау үшін: дауласпаңыз және онікін дұрыс емес деп айтпаңыз, сонда  проблемаларыңыз шешіліп бәрі жақсы болады.',
            }
        }
    ]
    TEST_6_POSITIVE = [
        {
            'ru': {
                'points': '1.5-2.0',
                'characteristic': 'Гнев',
                'description': 'Сразу рисуется картина: человек в гневе - босс, который держит в страхе весь персонал офиса. Вечный «плохой полицейский». Все не правы, всех наказать, всех уволить. Есть только одна правильная точка зрения - его. Опирается на послушание через угрозы и наказания, кажется, что он - человек действия, жесткий и решительный руководитель, который наведет порядок.                          У него редко задерживаются способные и перспективные люди, обычно остаются сотрудники в хронически низких тонах. Создает много шума и видимости руководства, но из-за всеобщего страха в компании очень мало что происходит. В том, что не получилось, человек в гневе винит бездарное окружение.',
            },
            'kz': {
                'points': '1.5-2.0',
                'characteristic': 'Ашу',
                'description': 'Бірден мынадай сурет көз алдына елестейді: ашуланған адам - бүкіл кеңсе қызметкерлерін қорқынышта ұстайтын бастық. Ол әрқашан «нашар полицей». Барлығы дұрыс емес нәрсе істейді, бәрін жазалап, бәрін жұмыстан шығару керек. Бір ғана дұрыс пікір бар – ол өзінікі. Қорқыту және жазалау арқылы басқарғысы келеді, кейде ол қатаң тәртіп орнататын, қатал, бәрін тәртіпке келтіретін тасжүрек басшы болып көрінеді. Оның айналасында дарынды және перспективалы адамдар сирек, әдетте, жанында төмен тондардағы қызметкерлер қалады. Басшылықта жиі шу тудырады, жалпы, қорқыныштан компанияда бірнәрсе сирек болады. Егер бірнәрсе жүзеге аспай жатса, бұл адам айналасындағылардың қабілетсіздігінен деп біледі.',
            }
        }
    ]
    TEST_6_NEGATIVE = [
        {
            'ru': {
                'points': '1.1-1.4',
                'characteristic': 'Скрытая враждебность',
                'description': 'Следующий тон - самый опасный и вредоносный. Скрытая враждебность, когда человек часто кажется приятным, но на деле боится вступить в прямое противостояние и пакостит исподтишка. Тон неприятен тем, что зачастую это достаточно победная стратегия, приносящая определенные достижения в жизни. Лицемерные личности, предатели, улыбающиеся в глаза и всаживающие нож в спину. Общение с ними выводит из душевного равновесия и заставляет сомневаться в себе и своих способностях. Эти люди искажают правду, радостно передают плохие новости и разносят сплетни. Часто выдают себя за экспертов, будучи дилетантами, присваивают чужие достижения и интеллектуальную собственность.    Лучший совет в отношении людей в хронической скрытой враждебности - свести общение с ними к минимуму или вообще убрать из своего окружения. Обычно они создают впечатление трудолюбивых и милых людей, командных игроков, но по факту расстраивают команду и всегда находят виновных в своих ошибках. Настраивают людей друг против друга и критикуют компанию. Нарушают договоренности.',
            },
            'kz': {
                'points': '1.1-1.4',
                'characteristic': 'Жасырын дұшпандық',
                'description': 'Келесі тон – өте қауіпті және зиянды. Жасырын дұшпандық деп – адам жағымды болып көрініп, бірақ шын мәнінде, тікелей қақтығыс пен қулыққа барудан қорқуын айтады. Бұл тон өмірде жиі жеңістер әкелетін стратегияларының барлығымен жағымсыз болып табылады. Бұлар - екіжүзділер, сатқындар, көзіне күлімдеп, арқасынан пышақ сұғатындар. Олармен сөйлесу жан дүние тыныштығын бұзады, өзіңе және өз қабілеттеріңе күмәндануға алып келеді. Бұл адамдар ақиқатты бұрмалап, қуанып жаман хабар таратады, өсек таратады. Олар өздерін сарапшы санайды, өзгелердің жетістігі мен зияткерлік меншігін өзіне жапсырып алады. Жасырын дұшпандықтағы адамдармен қарым-қатынастағы ең жақсы кеңес – олармен минималды байланыста болу немесе оларды мүлде айналаңыздан аластату керек. Әдетте олар еңбекқор және жақсы команда ойыншылары сияқты әсер қалдырады, бірақ шын мәнінде олар команданы ренжітіп және әрқашан өз қателері үшін жауаптыларды табады. Адамдарды шағыстырады және компанияны сынайды. Келісімді жиі бұзады.',
            }
        }
    ]
    TEST_7_POSITIVE = [
        {
            'ru': [
                {
                    'points': '0.6-1.0',
                    'characteristic': 'Горе',
                    'description': 'Человек в хроническом горе - застрявший в своей реальной или вымышленной потере. Просит о помощи, взывает к жалости, может осознанно лгать, чтобы получить поддержку. Если вы находите и устраняете причину горя - он тут же находит другую. Плохо на работе, плохо в семье, в мире кошмар творится. Это вечные нытики, все время говорящие о проблемах, трагедиях, болезнях, но ничего не делающие, чтобы что-то изменить.',
                },
                {
                    'points': '0.6-1.0',
                    'characteristic': 'Страх',
                    'description': 'Люди в классическом состоянии страха постоянно напуганы, везде видят опасности. В Африке вирус Эбола - он в Беларуси паникует. В его речи много фраз наподобие «осторожность не помешает», «не стоит рисковать», «всякое может случиться». Его внимание рассеяно: выключил ли утюг дома, закрыл ли машину. Поэтому он допускает много ошибок, препятствует всему новому («как бы чего не вышло»): «Сейчас опасно выходить на этот рынок», «Слишком рискованно», «Нас могут привлечь к ответственности»… Постоянно откладывает или вовсе сам никогда не принимает решений. Часто обманывает и изворачивается. Зато это просто находка для внимательного продавца, который продаст ему все через идею безопасности.',
                }
            ],

            'kz': [
                {
                    'points': '0.6-1.0',
                    'characteristic': 'Қайғы',
                    'description': 'Созылмалы қайғы-қасіреттегі адам - өзінің қазіргі немесе ойдан шығарылған әлемінде жоғалып қалған. Көмек сұрайды, аяушылыққа шақырады, қолдау алу үшін біле тұра өтірік айтуы мүмкін. Егер сіз қайғының себебін тауып беріп, оның көзін жойсаңыз, ол бірден басқасын тауып алады. Жұмысында да, отбасында да бәрі жаман, әлемде сұмдық болып жатыр. Бұлар «мәңгілік жылауықтар», әрқашан проблема, қайғылы оқиғалар, аурулар туралы айтады, бірақ бір нәрсені өзгерту үшін ештеңе жасамайды.',
                },
                {
                    'points': '0.6-1.0',
                    'characteristic': 'Қорқыныш',
                    'description': 'Бұл адамдар классикалық қорқыныш күйінде, барлық жерде қауіпті көріп, қорқып жүреді. Африкада Эбола вирусы жүріп жатса, ол Беларусияда жүріп, қорқып жүреді. Оның сөзінде «сақтықта қорлық жоқ», «тәуекел етудің қажеті жоқ», «бәрі де болуы мүмкін» деген тіркестер көп. Оның назары үнемі шашыраңқы: үйдегі үтікті өшірдім бе, көлікті құлыптадым ба? Сондықтан ол көптеген қателіктер жібереді, жаңа нәрселерге тосқауыл болады («бір нәрсе болып қалмаса, игі еді»): «Енді бұл нарыққа кіру – қауіпті», «Тым қауіпті», «Бізді жауапкершілікке алуы мүмкін»... Ол үнемі шешім қабылдауды кейінге қалдырады немесе ешқашан өздігінен шешім қабылдай алмайды. Адамдарды жиі алдайды және айлакерлік жасайды.',
                }
            ]
        }
    ]
    TEST_7_NEGATIVE = [
        {
            'ru': {
                'points': '0.1-0.5',
                'characteristic': 'Апатия',
                'description': 'Апатия это тягостное состояние вялости, безразличия, отсутствия сил и мотивации. Может утрачиваться интерес к хобби и к вещам, которые раньше казались захватывающими и важными. Такие признаки, конечно, не редкость. Однако не стоит их недооценивать. В некоторых ситуациях это состояние не только снижает качество жизни, но и может быть опасным. Например, если человек болен соматическим заболеванием, апатия будет мешать ему обрести мотивацию к лечению. Также апатия может быть симптомом ряда психических и неврологических расстройств. Этот человек крайне непродуктивен, безответственен, полностью отстранен от реальности и может причинить вред себе и ущерб другим (отпилить палец болгаркой, оставить включенными электроприборы). Он не ценит собственность, его имущество обычно находится в плохом состоянии. Поэтому, если у человека настораживающие признаки, лучше не игнорировать проблему, а постараться в ней разобраться. В противном случае, человек может опуститься еще ниже по шкале тонов. Это 0.0 по шкале тонов - Смерть.',
            },
            'kz': {
                'points': '0.1-0.5',
                'characteristic': 'Апатия',
                'description': 'Апатия - немқұрайлылықтың, күш пен мотивацияның болмауының ауыр күйі. Хоббиге және бұрын қызықты әрі маңызды болып көрінген нәрселерге қызығушылық жоғалуы мүмкін.Мұндай белгілер, әрине, сирек кездеспейді. Дегенмен, оларды елемеудің қажеті жоқ. Кейбір кездерде бұл жағдай өмір сапасын төмендетіп қана қоймайды, сонымен қатар қауіпті болуы мүмкін. Мысалы, егер адам соматикалық аурумен ауырса, апатия емделуге мотивация алуға кедергі жасайды. Сондай-ақ апатия бірқатар психикалық және неврологиялық бұзылыстардың симптомы болуы мүмкін. Бұл адам өте өнімсіз, жауапсыз, шындықтан мүлдем алшақ, өзіне және басқаларға зиян келтіруі мүмкін (саусағын тегістеуішпен кесіп алу, электр құрылғыларын қосулы қалдыру). Ол мүлікті бағаламайды, сол себепті оның мүлкі әдетте нашар жағдайда болады. Сондықтан, егер адамда мұндай белгілер болса, мәселені елеусіз қалдырмай, оны түсінуге тырысқан жөн. Әйтпесе, адам бұл тоннан да төмен түсуі мүмкін. Бұл тоннан кейінгі төменгі тон – өлім.',
            }
        }
    ]


def process_test_four(questions: list) -> dict:
    results = get_results_for_test_four(questions)
    tests = get_tests_for_test_four(*results)
    return {'characteristics': result_for_test_four(*tests)}


def get_results_for_test_four(questions: list) -> tuple:
    result_1 = result_2 = result_3 = result_4 = result_5 = result_6 = result_7 = 0

    for i, value in enumerate(questions):
        j = i + 1
        if j in TestFour.group_1:
            if value:
                result_1 += 1
        elif j in TestFour.group_2:
            if value:
                result_2 += 1
        elif j in TestFour.group_3:
            if value:
                result_3 += 1
        elif j in TestFour.group_4:
            if value:
                result_4 += 1
        elif j in TestFour.group_5:
            if value:
                result_5 += 1
        elif j in TestFour.group_6:
            if value:
                result_6 += 1
        elif j in TestFour.group_7:
            if value:
                result_7 += 1

    return result_1, result_2, result_3, result_4, result_5, result_6, result_7


def get_tests_for_test_four(result_1, result_2, result_3, result_4, result_5, result_6, result_7) -> tuple:
    if result_1 > (len(TestFour.group_1) - 1) / 2:
        test_1 = True
    else:
        test_1 = False

    if result_2 > len(TestFour.group_2) / 2:
        test_2 = True
    else:
        test_2 = False

    if result_3 > len(TestFour.group_3) / 2:
        test_3 = True
    else:
        test_3 = False

    if result_4 > (len(TestFour.group_4) - 1) / 2:
        test_4 = True
    else:
        test_4 = False

    if result_5 > (len(TestFour.group_5) - 1) / 2:
        test_5 = True
    else:
        test_5 = False

    if result_6 > len(TestFour.group_6) / 2:
        test_6 = True
    else:
        test_6 = False

    if result_7 > (len(TestFour.group_7) - 1) / 2:
        test_7 = True
    else:
        test_7 = False

    return test_1, test_2, test_3, test_4, test_5, test_6, test_7


def result_for_test_four(test_1, test_2, test_3, test_4, test_5, test_6, test_7) -> list[dict[str, dict[str, str] | dict[str, str]]]:
    if test_1:
        if test_2:
            if test_4:
                return TestFour.TEST_4_POSITIVE
            else:
                return TestFour.TEST_4_NEGATIVE
        else:
            if test_5:
                return TestFour.TEST_5_POSITIVE
            else:
                return TestFour.TEST_5_NEGATIVE
    else:
        if test_3:
            if test_6:
                return TestFour.TEST_6_POSITIVE
            else:
                return TestFour.TEST_6_NEGATIVE
        else:
            if test_7:
                return TestFour.TEST_7_POSITIVE
            else:
                return TestFour.TEST_7_NEGATIVE
