Repository: ndusenbai/beProBackend
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk

source: Неправильный старый пароль
kk: Қате ескі құпия сөз

source: Token expired
kk: Таңбалауыштың мерзімі аяқталды

source: Введите код
kk: Кодты енгізіңіз

source: Неправильный код
kk: Қате код

source: Код истёк
kk: Кодтың мерзімі аяқталды

source: Пользователь с данной электронной почтой уже зарегистрирован в системе
kk: Осы электрондық поштасы бар пайдаланушы Жүйеде тіркелген

source: Такая почта уже существует!
kk: Мұндай поштасы бар пайдаланушы қазірдің өзінде бар

source: Письмо отправлено!
kk: Хат жіберілді!

source: Вы не осуществляли check in сегодня
kk: Сіз бүгін тексеру жүргізген жоқсыз

source: У Вас нет доступа к статистике
kk: Сіз статистикаға қол жеткізе алмайсыз

source: Вы отпросились, нельзя заполнить статистику
kk: Сіз сұрадыңыз, статистиканы толтыра алмайсыз

source: В отпуске нельзя заполнить статистику
kk: Демалыста сіз статистиканы толтыра алмайсыз

source: Чек-ин и чек-аут заполнены. Нельзя заполнить статистику
kk: Тексеру және тексеру аяқталды. Статистиканы толтыру мүмкін емес

source: Поменяйте видимость на Employees
kk: Көрінуді қызметкерлерге ауыстырыңыз

source: Статистика уже заполнена
kk: Статистика қазірдің өзінде толық

source: Тариф компании истек. Необходимо обновить тариф
kk: Компанияның тарифі аяқталды. Тарифті жаңарту қажет

source: Наблюдатель с такой почтой уже создан
kk: Мұндай поштасы бар бақылаушы қазірдің өзінде құрылды

source: Компания с таким названием уже существует
kk: Мұндай атауы бар Компания қазірдің өзінде бар

source: Не забудьте сделать check in!
kk: Check in жасауды ұмытпаңыз!

source: Не забудьте сделать check out!
kk: Check out жасауды ұмытпаңыз!

source: Нет оплаченных заявок
kk: Ақылы өтінімдер жоқ

source: Данный пользователь уже сдавал вариант этого теста
kk: Бұл Пайдаланушы осы тесттің нұсқасын тапсырды

source: Тест уже пройден и не может быть сдан повторно
kk: Тест өтіп үлгерді және оны қайта тапсыру мүмкін емес

source: Невозможно отправить приглашение, т.к. не указана электронная почта
kk: Шақыру жіберу мүмкін емес, себебі электрондық пошта көрсетілмеген

source: Невозможно отправить приглашение, т.к. тест уже пройден
kk: Шақыру жіберу мүмкін емес, өйткені тест аяқталды

source: Необходимо сначала оплатить тест
kk: Алдымен тест үшін ақы төлеу керек

source: Добавьте комментарий
kk: Пікір қосыңыз

source: Нельзя отпроситься на время отпуска
kk: Сіз демалыс уақытында сұрай алмайсыз

source: Вы уже осуществили check out на текущий день
kk: Сіз ағымдағы күні check out-ты жүзеге асырдыңыз

source: У этого сотрудника уже есть статус check_in на указанный промежуток.
kk: Бұл қызметкердің белгіленген аралықта check_in мәртебесі бар.

source: Дата начала отпуска не может быть позже или равным, чем дата окончания отпуска
kk: Демалыстың басталу күні демалыстың аяқталу күнінен кешірек немесе оған тең бола алмайды

source: Введите time_from & time_to
kk: time_from & time_to енгізіңіз

source: Неверный статус!
kk: Қате мәртебе!

source: Вы не находитесь в радиусе вашего отдела
kk: Сіз өзіңіздің бөліміңіздің радиусындасыз

source: Заполните статистику
kk: Статистиканы толтырыңыз

source: Сначала сделайте check out
kk: Алдымен checkout жасаңыз

source: Еще рано до check out
kk: Check out алдында әлі ерте

source: Уже есть пользователь с такой почтой
kk: Мұндай поштасы бар пайдаланушы бар

source: Вы сегодня отпросились
kk: Сіз бүгін сұрадыңыз

source: Сделайте чекаут
kk: Checkout жасаңыз

source: Сегодня нерабочий день
kk: Бүгін жұмыс күні емес

source: Вы уже осуществили check in сегодня
kk: Сіз бүгін check in жасадыңыз

source: Нужно сделать check in заново
kk: Қайта тексеру керек

source: В указанный промежуток уже есть check_in
kk: Көрсетілген аралықта check_in бар
